IDEA Open Model
ResultOfDeformation2 Properties
Compatible with IDEA StatiCa 20.1
The ResultOfDeformation2 type exposes the following members.
Properties
Name | Description
Fix
 Rotation around x-axis
Fiy
 Rotation around y-axis
Fiz
 Rotation around z-axis
Loading
 LoadingTypeClass
Ux
 Deformation in the x direction
Uy
 Deformation in the y direction
Uz
 Deformation in the z direction
Top
See Also
Reference
ResultOfDeformation2 Class
IdeaRS.OpenModel.Result Namespace